hierarchy -check
proc
techmap
opt
abc -g NOR
opt
clean