read_verilog /root/input/g77_boolean.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix /root/output/g77_boolean_yosys
write_edif /root/output/g77_boolean.edif
write_json /root/output/g77_boolean.json
